src/Catalogs/ВидыДокументовФизическихЛиц/ВидыДокументовФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыДокументовФизическихЛиц</name>
  <predefined>
    <items>
      <name>ВодительскоеУдостоверение</name>
      <description>Водительское удостоверение</description>
    </items>
    <items>
      <name>ВоенныйБилет</name>
      <description>Военный билет</description>
    </items>
    <items>
      <name>ВоенныйБилетОфицераЗапаса</name>
      <description>Военный билет офицера запаса</description>
    </items>
    <items>
      <name>ДипломатическийПаспорт</name>
      <description>Дипломатический паспорт гражданина РФ</description>
    </items>
    <items>
      <name>ЗагранпаспортРФ</name>
      <description>Загранпаспорт гражданина РФ</description>
    </items>
    <items>
      <name>ЗагранпаспортСССР</name>
      <description>Загранпаспорт гражданина СССР</description>
    </items>
    <items>
      <name>ПаспортРФ</name>
      <description>Паспорт гражданина РФ</description>
    </items>
    <items>
      <name>ПаспортСССР</name>
      <description>Паспорт гражданина СССР</description>
    </items>
    <items>
      <name>ПаспортМинморфлота</name>
      <description>Паспорт Минморфлота</description>
    </items>
    <items>
      <name>ПаспортМоряка</name>
      <description>Паспорт моряка</description>
    </items>
    <items>
      <name>СвидетельствоОРождении</name>
      <description>Свидетельство о рождении</description>
    </items>
    <items>
      <name>УдостоверениеОфицера</name>
      <description>Удостоверение личности офицера</description>
    </items>
  </predefined>
  <attributes>
    <name>КодМВД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПФР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ВидыДокументовФизическихЛиц/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Параметры.Отбор.Вставить("ПометкаУдаления",Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Процедура заполняет справочник "Документы физических лиц" по классификатору МВД.
//
Процедура ЗаполнитьДокументыФизическихЛицПоКлассификаторуМВД() Экспорт 
	
	СоздатьОбновитьДокументФизЛиц(
		Справочники.ВидыДокументовФизическихЛиц.ПаспортСССР,
		"",
		"01",
		НСтр("ru='ПАСПОРТ'")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		Справочники.ВидыДокументовФизическихЛиц.ЗагранпаспортСССР,
		"",
		"02",
		НСтр("ru='ЗГПАСПОРТ'")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		Справочники.ВидыДокументовФизическихЛиц.СвидетельствоОРождении,
		"",
		"03",
		НСтр("ru='СВИД О РОЖД'")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		Справочники.ВидыДокументовФизическихЛиц.УдостоверениеОфицера,
		"",
		"04",
		НСтр("ru='УДОСТ ОФИЦЕРА'")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		,
		НСтр("ru='Справка об освобождении'"),
		"05",
		НСтр("ru='СПРАВКА ОБ ОСВ'")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		Справочники.ВидыДокументовФизическихЛиц.ПаспортМинморфлота,
		"",
		"06",
		НСтр("ru='ПАСПОРТ МОРФЛТ'")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		Справочники.ВидыДокументовФизическихЛиц.ВоенныйБилет,
		НСтр("ru='Военный билет солдата (матроса, сержанта, старшины)'"),
		"07",
		НСтр("ru='ВОЕННЫЙ БИЛЕТ'")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		,
		НСтр("ru='Временное удостоверение, выданное взамен военного билета'"),
		"08",
		НСтр("ru='ПРОЧЕЕ'")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		Справочники.ВидыДокументовФизическихЛиц.ДипломатическийПаспорт,
		"",
		"09",
		НСтр("ru='ДИППАСПОРТ РФ'")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		,
		НСтр("ru='Иностранный паспорт'"),
		"10",
		НСтр("ru='ИНПАСПОРТ'")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		,
		НСтр("ru='Свидетельство о регистрации ходатайства иммигранта о признании его беженцем'"),
		"11",
		НСтр("ru='СВИД БЕЖЕНЦА'")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		,
		НСтр("ru='Вид на жительство'"),
		"12",
		НСтр("ru='ВИД НА ЖИТЕЛЬ'")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		,
		НСтр("ru='Удостоверение беженца'"),
		"13",
		НСтр("ru='УДОСТ БЕЖЕНЦА'")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		,
		НСтр("ru='Временное удостоверение личности гражданина РФ'"),
		"14",
		НСтр("ru='ВРЕМ УДОСТ'")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		,
		НСтр("ru='Разрешение на временное проживание в Российской Федерации'"),
		"15",
		НСтр("ru='ПРОЧЕЕ'")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		,
		НСтр("ru='Свидетельство о предоставлении временного убежища на территории Российской Федерации'"),
		"18",
		НСтр("ru='ПРОЧЕЕ'")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ,
		"",
		"21",
		НСтр("ru='ПАСПОРТ РОССИИ'")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		Справочники.ВидыДокументовФизическихЛиц.ЗагранпаспортРФ,
		"",
		"22",
		НСтр("ru='ЗГПАСПОРТ РФ'")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		,
		НСтр("ru='Свидетельство о рождении, выданное уполномоченным органом иностранного государства'"),
		"23",
		НСтр("ru='ПРОЧЕЕ'")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		,
		НСтр("ru='Удостоверение личности военнослужащего Российской Федерации'"),
		"24",
		НСтр("ru='ПРОЧЕЕ'")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		Справочники.ВидыДокументовФизическихЛиц.ПаспортМоряка,
		"",
		"26",
		НСтр("ru='ПАСПОРТ МОРЯКА'")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		Справочники.ВидыДокументовФизическихЛиц.ВоенныйБилетОфицераЗапаса,
		"",
		"27",
		НСтр("ru='БИЛЕТ ОЗ'")
	);
	
	СоздатьОбновитьДокументФизЛиц(
		,
		НСтр("ru='Иные документы, выдаваемые органами МВД'"),
		"91",
		НСтр("ru='ПРОЧЕЕ'")
	);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьОбновитьДокументФизЛиц(СсылкаНаЭлемент = Неопределено, Наименование = "", КодМВД = "", КодПФР = "")
	
	Если Не ЗначениеЗаполнено(СсылкаНаЭлемент) Тогда
		Если Наименование = "" Тогда
			Возврат
		КонецЕсли;
		
		СсылкаНаЭлемент = Справочники.ВидыДокументовФизическихЛиц.НайтиПоНаименованию(Наименование);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СсылкаНаЭлемент) Тогда
		ДанныеИБ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаЭлемент, "КодМВД, КодПФР");
		Если ДанныеИБ.КодМВД = КодМВД И ДанныеИБ.КодПФР = КодПФР Тогда
			Возврат
		КонецЕсли;
		
		Элемент = СсылкаНаЭлемент.ПолучитьОбъект();
		
	Иначе
		Элемент = Справочники.ВидыДокументовФизическихЛиц.СоздатьЭлемент();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Наименование) Тогда
		Элемент.Наименование = Наименование;
	КонецЕсли;
	
	Элемент.КодМВД = КодМВД;
	Элемент.КодПФР = КодПФР;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(Элемент);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
